LMN-SCUT/NUEDC-2026-Car/controller-stm32/h60-f407-line-car/User/main.c
            case APP_FINISHED:
            case APP_ERROR:
            default:
                Motor_Stop();
                break;
        }
        continue;
#else

        if (!NewGray_Read(&gray)) {
            Motor_Stop();
            gray_i2c_online = 0U;
            gray_i2c_error = NewGray_LastError();
            app_state = APP_ERROR;
        } else {
            gray_i2c_online = 1U;
            gray_i2c_error = 0U;
            publish_gray_debug(&gray);
#if HC05_TEST_STREAM_ENABLE && !APP_ENABLE_MOTORS
            /*
             * 电机安全开关关闭时也运行循迹计算，专供手推横移验证误差方向。
             * Motor_SetSidePercent在该编译模式下会强制保持全部PWM为0。
             */
            line_status = LineFollower_Update(&gray);
            line_error = LineFollower_Error();
#endif
        }

#if HC05_TEST_STREAM_ENABLE && !APP_ENABLE_MOTORS
        if ((uint32_t)(Timebase_Millis() - last_test_stream_ms) >=
            HC05_TEST_STREAM_PERIOD_MS) {
            last_test_stream_ms = Timebase_Millis();
            send_gray_test_frame();
        }
#endif

        if (gray_i2c_online == 0U) {
            continue;
        }

        Encoder_ReadAndReset(&encoder_delta);
        encoder_delta_debug = encoder_delta;

        switch (app_state) {
            case APP_WAIT_START:
                SpeedPI_Reset();
                run_time_ms = 0U;
                track_finish_armed = 0U;
                track_finish_detected = 0U;
                start_marker_clear_frames = 0U;
                finish_marker_frames = 0U;
                track_encoder_sum.ma = 0;
                track_encoder_sum.mb = 0;
                track_encoder_sum.mc = 0;
                track_encoder_sum.md = 0;
                track_target_sum.ma = 0;
                track_target_sum.mb = 0;
                track_target_sum.mc = 0;
                track_target_sum.md = 0;
                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >= 1000U) {
                    last_track_report_ms = Timebase_Millis();
                    send_wait_test_frame();
                }
                if (Key_StartPressedEvent() != 0U) {
                    run_started_ms = Timebase_Millis();
                    LineFollower_Init();
                    SpeedPI_Reset();
                    MotorProtection_Reset(Timebase_Millis());
                    app_state = APP_RUNNING;
                    last_track_report_ms = run_started_ms;
                    HC05_SendString("KEY_OK,MAP_RUN_START\r\n");
                }
                break;

            case APP_RUNNING:
                run_time_ms =
                    (uint32_t)(Timebase_Millis() - run_started_ms);
                track_encoder_sum.ma += encoder_delta.ma;
                track_encoder_sum.mb += encoder_delta.mb;
                track_encoder_sum.mc += encoder_delta.mc;
                track_encoder_sum.md += encoder_delta.md;

                /*
                 * 当前阶段忽略A点启停横线，只验证环形循迹稳定性。
                 * 从按键确认启动的时刻计时，达到30秒立即主动短刹车并锁定停止。
                 */
                if (run_time_ms >= APP_TIMED_RUN_MS) {
                    SpeedPI_Reset();
                    Motor_Brake();
                    app_state = APP_FINISHED;
                    HC05_SendString("TIMEOUT_30S,BRAKE\r\n");
                    break;
                }

                line_status = LineFollower_Update(&gray);
                line_error = LineFollower_Error();
                if ((line_status == LINE_ADC_ERROR) ||
                    (line_status == LINE_LOST_STOP)) {
                    SpeedPI_Reset();
                    app_state = APP_ERROR;
                    HC05_SendString("LINE_OR_I2C_ERROR,STOP\r\n");
                    break;
                }

                /*
                 * A点横向线状态机：
                 * 启动时车就在A横线上，必须先连续5帧离开宽黑才允许判终点；
                 * 运行至少5秒后再次连续3帧见宽黑，判定完成一圈并主动制动。
                 * 最小时间门控可过滤启动横线和近距离宽黑抖动。
                 */
                if (line_status != LINE_WIDE_MARKER) {
                    finish_marker_frames = 0U;
                    if (track_finish_armed == 0U) {
                        if (start_marker_clear_frames <
                            APP_START_MARKER_CLEAR_FRAMES) {
                            start_marker_clear_frames++;
                        }
                        if (start_marker_clear_frames >=
                            APP_START_MARKER_CLEAR_FRAMES) {
                            track_finish_armed = 1U;
                            HC05_SendString("A_MARKER_LEFT,FINISH_ARMED\r\n");
                        }
                    }
                } else if ((track_finish_armed != 0U) &&
                           (run_time_ms >= APP_FINISH_MIN_MS)) {
                    if (finish_marker_frames <
                        APP_FINISH_MARKER_FRAMES) {
                        finish_marker_frames++;
                    }
                    if (finish_marker_frames >=
                        APP_FINISH_MARKER_FRAMES) {
                        track_finish_detected = 1U;
                        SpeedPI_Reset();
                        Motor_Brake();
                        app_state = APP_FINISHED;
                        HC05_SendString("A_FINISH_DETECTED,MS=");
                        HC05_SendInt32((int32_t)run_time_ms);
                        HC05_SendString(",BRAKE\r\n");
                        break;
                    }
                }

                /*
                 * 串级控制：灰度PD只生成左右速度目标，四轮编码器PI才写PWM。
                 * 左侧目标复制给MA/MB，右侧目标复制给MC/MD。
                 */
                SpeedPI_SetSidePercentTargets(
                    LineFollower_LeftTargetPercent(),
                    LineFollower_RightTargetPercent());
                SpeedPI_Update(&encoder_delta);
                {
                    const SpeedPI_Status *speed = SpeedPI_GetStatus();
                    track_target_sum.ma += speed->target_ma;
                    track_target_sum.mb += speed->target_mb;
                    track_target_sum.mc += speed->target_mc;
                    track_target_sum.md += speed->target_md;
                }

                if (MotorProtection_Update(Timebase_Millis(),
                                           &encoder_delta)) {
                    SpeedPI_Reset();
                    app_state = APP_ERROR;
                    HC05_SendString("STALL_OR_ENCODER_ERROR,STOP\r\n");
                    break;
                }

                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >=
                    APP_TRACK_REPORT_MS) {
                    last_track_report_ms = Timebase_Millis();
                    send_track_test_frame(&track_encoder_sum,
                                          &track_target_sum,
                                          finish_marker_frames);
                    track_encoder_sum.ma = 0;
                    track_encoder_sum.mb = 0;
                    track_encoder_sum.mc = 0;
                    track_encoder_sum.md = 0;
                    track_target_sum.ma = 0;
                    track_target_sum.mb = 0;
                    track_target_sum.mc = 0;
                    track_target_sum.md = 0;
                }
                break;

            case APP_FINISHED:
                Motor_Brake();
                break;

            case APP_ERROR:
            default:
                SpeedPI_Reset();
                break;
        }
#endif
    }
}
